Revit 2024 API
InapplicableDataException Class
The exception that is thrown when attempting to access a piece of data that is structurally not part of an object at the moment.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[SerializableAttribute]
public class InapplicableDataException : InvalidOperationException
Visual Basic
<SerializableAttribute> _
Public Class InapplicableDataException _
	Inherits InvalidOperationException
Visual C++
[SerializableAttribute]
public ref class InapplicableDataException : public InvalidOperationException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.InapplicableDataException
See Also
InapplicableDataException Members
Autodesk.Revit.Exceptions Namespace